<template>
    <div class="flex flex-col gap-6">
       <p class="text-2xl font-semibold font-Nunito tracking-widest">Часто задаваемые вопросы</p>
       <div class="flex flex-col">
           <Questions v-for="FAQ in FAQs" v-bind="FAQ"></Questions>
       </div>
    </div>
</template>

<script setup>
    /* передача данных */
    const FAQs = [
        {
            question: "Какие квартиры мы берем в работу?",
            answer: "Ничего сверхъестественного: для Аренды подойдет большинство квартир. Важно, чтобы в них не было личных вещей собственника – всем арендаторам хочется чувствовать себя как дома."
        },
        {
            question: "Кто платит налоги за аренду?",
            answer: "Она поможет, если с квартирой что-то случится. Например, если жильцы внезапно съедут, сломают мебель или зальют соседей, мы компенсируем вам затраты на ремонт согласно лимитам."
        },
        {
            question: "Можно ли не отдавать ключи?",
            answer: "Можно, но тогда нам нужно будет согласовывать каждый показ квартиры с вами. Это значит, поиск жильцов может затянуться, а вам всё равно придётся выезжать на показы. "
        },
        {
            question: "Как быстро вы находите жильцов?",
            answer: "В среднем от заключения договора с Арендой до заезда жильцов проходит 10 дней. Но иногда бывает, что они находятся через 2 часа после публикации объявления."
        },
        {
            question: "Что если собственников двое или больше?",
            answer: "Это не проблема, если все собственники согласны сдавать квартиру."
        },
        {
            question: "Можно ли сдать квартиру по доверенности?",
            answer: "Да, по нотариальной доверенности сдать квартиру тоже можно. Оставьте заявку на сайте, мы позвоним и всё расскажем."
        }
    ]
</script>